test_cases/cylinder_2D_Re100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          2.0e-3;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
    forces
    {
        type             forceCoeffs;
        libs             (forces);
        executeControl   writeTime;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        log false;
        patches
        (
            cylinder
        );
        rhoInf      1;
        rho         rhoInf;
        CofR        (0.2 0.2 0.005);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        0.1;
        Aref        0.001;
    }

    time
    {
        type            timeInfo;
        libs            (utilityFunctionObjects);
        timeStart       0;
        perTimeStep     yes;
    }
}

// ************************************************************************* //
