test_cases/cylinder_2D_Re100/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. "${WM_PROJECT_DIR:?}"/bin/tools/RunFunctions
#------------------------------------------------------------------------------

runParallel $(getApplication)

#------------------------------------------------------------------------------
